# [Filterungen] Umgang mit NULL-Werten

In [1]:
import pandas as pd
import numpy as np

### Anwendungsbeispiel

In [16]:
# Sitz, Umsatz, Ergebnis, Mitarbeiter
sports = pd.DataFrame({"NIKE" : ["USA", np.NaN, 7, 80000], 
             "ADI" : ["DE", 22, 0.5, np.NaN], 
             "PUMA" : ["DE", np.NaN, np.NaN, 18000]}, 
                      index=["Sitz", "Umsatz", "Ergebnis", "Mitarbeiter"])

## Umgang mit NULL

In [9]:
sports.isnull()

              NIKE    ADI   PUMA
Sitz         False  False  False
Umsatz        True  False   True
Ergebnis     False  False   True
Mitarbeiter  False   True  False

In [10]:
sports

              NIKE  ADI   PUMA
Sitz           USA   DE     DE
Umsatz         NaN   22    NaN
Ergebnis         7  0.5    NaN
Mitarbeiter  80000  NaN  18000

In [13]:
print(sports["NIKE"].isnull().sum())
print(sports["ADI"].isnull().sum())
print(sports["PUMA"].isnull().sum())

1
1
2

### fillna()-Methode

In [14]:
sports.fillna(0, inplace=True)

In [15]:
sports

              NIKE  ADI   PUMA
Sitz           USA   DE     DE
Umsatz           0   22      0
Ergebnis         7  0.5      0
Mitarbeiter  80000    0  18000

In [17]:
sports.fillna("Keine Angabe", inplace=True)

In [18]:
sports

                     NIKE           ADI          PUMA
Sitz                  USA            DE            DE
Umsatz       Keine Angabe            22  Keine Angabe
Ergebnis                7           0.5  Keine Angabe
Mitarbeiter         80000  Keine Angabe         18000